Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition.HierarchicChildren Property
 An array list that contains the hierarchical definition's children.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList HierarchicChildren { get; set; }
Public Property HierarchicChildren As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace